// Data
var data = {
    home: `<h1>خانه</h1>
    <h2>این صفحه‌ی خانه است</h2>
    <img src="home-page.png">
    <p>به خانه‌ی خود خوش آمدید. اینجا جایی است که دیواره‌ها دل‌ها را می‌پوشانند و پنجره‌ها به دنیایی دیگر باز
        می‌شوند. در این خانه، بوی قهوه از آشپزخانه می‌آید و صدای باران از پنجره‌ها می‌شنویم. اینجا جایی است که
        خاطرات تازه می‌سازیم و عشق در هوا حس می‌شود. خوش آمدید به خانه‌ی ما! 🏡❤️</p>`,
    blog: `<h1>وبلاگ</h1>
    <h2>این صفحه‌ی وبلاگ است</h2>
    <img src="home-page.png">
    <p>به خانه‌ی خود خوش آمدید. اینجا جایی است که دیواره‌ها دل‌ها را می‌پوشانند و پنجره‌ها به دنیایی دیگر باز
        می‌شوند. در این خانه، بوی قهوه از آشپزخانه می‌آید و صدای باران از پنجره‌ها می‌شنویم. اینجا جایی است که
        خاطرات تازه می‌سازیم و عشق در هوا حس می‌شود. خوش آمدید به خانه‌ی ما! 🏡❤️</p>`,
    courses: `<h1>دوره‌ها</h1>
    <h2>این صفحه‌ی دوره‌ها است</h2>
    <img src="home-page.png">
    <p>به خانه‌ی خود خوش آمدید. اینجا جایی است که دیواره‌ها دل‌ها را می‌پوشانند و پنجره‌ها به دنیایی دیگر باز
        می‌شوند. در این خانه، بوی قهوه از آشپزخانه می‌آید و صدای باران از پنجره‌ها می‌شنویم. اینجا جایی است که
        خاطرات تازه می‌سازیم و عشق در هوا حس می‌شود. خوش آمدید به خانه‌ی ما! 🏡❤️</p>`,
    aboutUs: `<h1>درباره‌ی ما</h1>
    <h2>این صفحه‌ی درباره‌ی ما است</h2>
    <img src="home-page.png">
    <p>به خانه‌ی خود خوش آمدید. اینجا جایی است که دیواره‌ها دل‌ها را می‌پوشانند و پنجره‌ها به دنیایی دیگر باز
        می‌شوند. در این خانه، بوی قهوه از آشپزخانه می‌آید و صدای باران از پنجره‌ها می‌شنویم. اینجا جایی است که
        خاطرات تازه می‌سازیم و عشق در هوا حس می‌شود. خوش آمدید به خانه‌ی ما! 🏡❤️</p>`,
    contactUs: `<h1>تماس با ما</h1>
    <h2>این صفحه‌ی تماس با ما است</h2>
    <img src="home-page.png">
    <p>به خانه‌ی خود خوش آمدید. اینجا جایی است که دیواره‌ها دل‌ها را می‌پوشانند و پنجره‌ها به دنیایی دیگر باز
        می‌شوند. در این خانه، بوی قهوه از آشپزخانه می‌آید و صدای باران از پنجره‌ها می‌شنویم. اینجا جایی است که
        خاطرات تازه می‌سازیم و عشق در هوا حس می‌شود. خوش آمدید به خانه‌ی ما! 🏡❤️</p>`
}
// Get all the links
var links = document.querySelectorAll(".navbar ul li");
const content = document.getElementById("content");
console.log(content);

// Loop through the links and add a click event listener
for (var i = 0; i < links.length; i++) {
    links[i].addEventListener("click", function (event) {
        // Prevent the default behavior of the link
        event.preventDefault();
        // Remove the active class from all the links
        for (var j = 0; j < links.length; j++) {
            links[j].classList.remove("active");
        }
        // Add the active class to the clicked link
        this.classList.add("active");

        var id = this.id;
        content.innerHTML = data[id];
    });
}